imbluedabr/m33mu/cpu/pic32ck/pic32ck_mmio.c
/* m33mu -- an ARMv8-M Emulator
 * SPDX-License-Identifier: AGPL-3.0-or-later
 */

#include <string.h>
#include <stdio.h>
#include "pic32ck/pic32ck_mmio.h"
#include "pic32ck/cpu_config.h"
#include "m33mu/code_cache.h"
#include "m33mu/flash_persist.h"
#include "m33mu/memmap.h"
#include "m33mu/mmio.h"
#include "m33mu/nvic.h"

#define PIC32CK_FLASH_PAGE_SIZE     4096u
#define PIC32CK_FLASH_ROW_SIZE      1024u
#define PIC32CK_FLASH_QDW_SIZE      32u
#define PIC32CK_FLASH_SDW_SIZE      8u
#define PIC32CK_FLASH_GRANULARITY   4096u
#define PIC32CK_RAM_GRANULARITY     4096u
#define PIC32CK_ANSC_GRANULARITY    4096u

#define PIC32CK_IDAU_REGION_ANSC    0x09u
#define PIC32CK_IDAU_REGION_ANS     0x0Au
#define PIC32CK_IDAU_REGION_RS      0x0Du
#define PIC32CK_IDAU_REGION_RNS     0x0Eu
#define PIC32CK_IDAU_REGION_CFMS    0x07u

#define PIC32CK_FUSE_FUCFG14_OFF    0x78u
#define PIC32CK_FUSE_FUCFG15_OFF    0x7Cu
#define PIC32CK_FUSE_IDAU_ANS_MASK  0x000001FFu
#define PIC32CK_FUSE_IDAU_ANSC_MASK 0x00010000u
#define PIC32CK_FUSE_IDAU_RNS_MASK  0x0000007Fu

struct pic32ck_idau_state {
    mm_bool enabled;
    mm_bool write_locked;
    mm_u32 statusb;
    mm_u32 ans_size;
    mm_u32 ansc_size;
    mm_u32 rns_size;
};

static struct mm_memmap *g_map;
static const struct mm_flash_persist *g_persist;
static mm_u8 cfm_buf[PIC32CK_CFM_SIZE];
static struct pic32ck_idau_state g_idau;
static mm_u8 *g_flash_ptr;
static mm_u32 g_flash_size;
static mm_bool cfm_initialized;
static mm_bool fcw_key_valid;

/* periph_stub -- lightweight register-file stub */
struct periph_stub {
    mm_u32  size;
    mm_u32 *regs;
};

static mm_bool stub_read(void *opaque, mm_u32 offset, mm_u32 size_bytes,
                         mm_u32 *value_out)
{
    const struct periph_stub *ps = (const struct periph_stub *)opaque;
    if (ps == 0 || value_out == 0 || size_bytes == 0 || size_bytes > 4u)
        return MM_FALSE;
    if ((offset + size_bytes) > ps->size) return MM_FALSE;
    memcpy(value_out, (const mm_u8 *)ps->regs + offset, size_bytes);
    return MM_TRUE;
}

static mm_bool stub_write(void *opaque, mm_u32 offset, mm_u32 size_bytes,
                          mm_u32 value)
{
    struct periph_stub *ps = (struct periph_stub *)opaque;
    if (ps == 0 || size_bytes == 0 || size_bytes > 4u) return MM_FALSE;
    if ((offset + size_bytes) > ps->size) return MM_FALSE;
    memcpy((mm_u8 *)ps->regs + offset, &value, size_bytes);
    return MM_TRUE;
}

#define DECL_STUB(N, S) \
    static mm_u32 N##_regs[(S) / 4u]; \
    static struct periph_stub N##_stub = { (S), N##_regs }

static mm_bool stub_reg_one(struct mmio_bus *bus, struct periph_stub *ps,
                            mm_u32 base)
{
    struct mmio_region reg;
    reg.base   = base;
    reg.size   = ps->size;
    reg.opaque = ps;
    reg.read   = stub_read;
    reg.write  = stub_write;
    return mmio_bus_register_region(bus, &reg);
}

/* MCLK (0x44012000, size 0x60) */
/* CLKMSK[0..8] at offsets 0x3C..0x5C */
#define MCLK_BASE    0x44012000u
#define MCLK_SIZE    0x60u
#define MCLK_CLKMSK0 0x3Cu
static mm_u32 mclk_regs[MCLK_SIZE / 4u];

static mm_bool mclk_read(void *opaque, mm_u32 offset, mm_u32 size_bytes,
                         mm_u32 *value_out)
{
    (void)opaque;
    if (value_out == 0 || size_bytes == 0 || size_bytes > 4u) return MM_FALSE;
    if ((offset + size_bytes) > MCLK_SIZE) return MM_FALSE;
    memcpy(value_out, (mm_u8 *)mclk_regs + offset, size_bytes);
    return MM_TRUE;
}

static mm_bool mclk_write(void *opaque, mm_u32 offset, mm_u32 size_bytes,
                          mm_u32 value)
{
    (void)opaque;
    if (size_bytes == 0 || size_bytes > 4u) return MM_FALSE;
    if ((offset + size_bytes) > MCLK_SIZE) return MM_FALSE;
    memcpy((mm_u8 *)mclk_regs + offset, &value, size_bytes);
    return MM_TRUE;
}

mm_bool mm_pic32ck_mclk_periph_active(mm_u32 clkmsk_reg, mm_u32 clkmsk_bit)
{
    mm_u32 off, val;
    if (clkmsk_reg > 8u) return MM_FALSE;
    off = MCLK_CLKMSK0 + clkmsk_reg * 4u;
    memcpy(&val, (mm_u8 *)mclk_regs + off, 4u);
    return ((val >> clkmsk_bit) & 1u) != 0u ? MM_TRUE : MM_FALSE;
}

/* OSCCTRL (0x4400C000, size 0xC0) */
/* STATUS at offset 0x10: bit24=PLL0LOCK, bit16=DFLLRDY, bit8=XOSCRDY, bit0=XOSCRDY0 */
/* SYNCBUSY at 0x78: always 0 (no sync delays in emulator) */
#define OSCCTRL_BASE     0x4400C000u
#define OSCCTRL_SIZE     0xC0u
#define OSCCTRL_STATUS   0x10u
#define OSCCTRL_SYNCBUSY 0x78u
static mm_u32 oscctrl_regs[OSCCTRL_SIZE / 4u];

static mm_bool oscctrl_read(void *opaque, mm_u32 offset, mm_u32 size_bytes,
                            mm_u32 *value_out)
{
    (void)opaque;
    if (value_out == 0 || size_bytes == 0 || size_bytes > 4u) return MM_FALSE;
    if ((offset + size_bytes) > OSCCTRL_SIZE) return MM_FALSE;
    if ((offset & ~3u) == (OSCCTRL_STATUS & ~3u)) {
        /* PLL0LOCK(24)|DFLLRDY(16)|XOSCRDY(8)|XOSCRDY0(0) all set */
        mm_u32 v = 0x01010101u;
        memcpy(value_out, (mm_u8 *)&v + (offset & 3u), size_bytes);
        return MM_TRUE;
    }
    if ((offset & ~3u) == (OSCCTRL_SYNCBUSY & ~3u)) {
        mm_u32 v = 0u;
        memcpy(value_out, (mm_u8 *)&v + (offset & 3u), size_bytes);
        return MM_TRUE;
    }
    memcpy(value_out, (mm_u8 *)oscctrl_regs + offset, size_bytes);
    return MM_TRUE;
}

static mm_bool oscctrl_write(void *opaque, mm_u32 offset, mm_u32 size_bytes,
                             mm_u32 value)
{
    (void)opaque;
    if (size_bytes == 0 || size_bytes > 4u) return MM_FALSE;
    if ((offset + size_bytes) > OSCCTRL_SIZE) return MM_FALSE;
    memcpy((mm_u8 *)oscctrl_regs + offset, &value, size_bytes);
    return MM_TRUE;
}

/* SUPC (0x44008000, size 0x30) */
/* STATUS at offset 0x0C:
 *   bit8=ADDVREGRDY0 (additional regulator ready -- needed by PLL0 init)
 *   bit4=BORVDDIOB, bit1=LVDRDY, bit0=LVDET
 * VREGCTRL at 0x1C (accept writes, return written value)
 * SYNCBUSY at 0x10: always 0
 */
#define SUPC_BASE    0x44008000u
#define SUPC_SIZE    0x30u
#define SUPC_STATUS  0x0Cu
static mm_u32 supc_regs[SUPC_SIZE / 4u];

static mm_bool supc_read(void *opaque, mm_u32 offset, mm_u32 size_bytes,
                         mm_u32 *value_out)
{
    (void)opaque;
    if (value_out == 0 || size_bytes == 0 || size_bytes > 4u) return MM_FALSE;
    if ((offset + size_bytes) > SUPC_SIZE) return MM_FALSE;
    if ((offset & ~3u) == (SUPC_STATUS & ~3u)) {
        /* ADDVREGRDY0(8)|BORVDDIOB(4)|LVDRDY(1)|LVDET(0) all set */
        mm_u32 v = 0x00000113u;
        memcpy(value_out, (mm_u8 *)&v + (offset & 3u), size_bytes);
        return MM_TRUE;
    }
    memcpy(value_out, (mm_u8 *)supc_regs + offset, size_bytes);
    return MM_TRUE;
}

static mm_bool supc_write(void *opaque, mm_u32 offset, mm_u32 size_bytes,
                          mm_u32 value)
{
    (void)opaque;
    if (size_bytes == 0 || size_bytes > 4u) return MM_FALSE;
    if ((offset + size_bytes) > SUPC_SIZE) return MM_FALSE;
    memcpy((mm_u8 *)supc_regs + offset, &value, size_bytes);
    return MM_TRUE;
}

static mm_u32 pic32ck_read_le32(const mm_u8 *buf, mm_u32 off)
{
    return ((mm_u32)buf[off]) |
           ((mm_u32)buf[off + 1u] << 8) |
           ((mm_u32)buf[off + 2u] << 16) |
           ((mm_u32)buf[off + 3u] << 24);
}

static void pic32ck_write_le32(mm_u8 *buf, mm_u32 off, mm_u32 value)
{
    buf[off] = (mm_u8)(value & 0xFFu);
    buf[off + 1u] = (mm_u8)((value >> 8) & 0xFFu);
    buf[off + 2u] = (mm_u8)((value >> 16) & 0xFFu);
    buf[off + 3u] = (mm_u8)((value >> 24) & 0xFFu);
}

static mm_u32 pic32ck_clamp_partition(mm_u32 value, mm_u32 gran, mm_u32 limit)
{
    if (gran == 0u) {
        return 0u;
    }
    value = (value / gran) * gran;
    if (value > limit) {
        value = (limit / gran) * gran;
    }
    return value;
}

static void pic32ck_apply_default_fuses(void)
{
    mm_u32 fucfg14 = pic32ck_read_le32(cfm_buf, PIC32CK_FUSE_FUCFG14_OFF);
    mm_u32 fucfg15 = pic32ck_read_le32(cfm_buf, PIC32CK_FUSE_FUCFG15_OFF);

