imbluedabr/m33mu/cpu/pic32ck/pic32ck_mmio.c
    if (fucfg14 == 0xFFFFFFFFu) {
        mm_u32 ans_units = (PIC32CK_FLASH_SIZE / 2u) / PIC32CK_FLASH_GRANULARITY;
        pic32ck_write_le32(cfm_buf, PIC32CK_FUSE_FUCFG14_OFF,
                           ans_units & PIC32CK_FUSE_IDAU_ANS_MASK);
    }
    if (fucfg15 == 0xFFFFFFFFu) {
        mm_u32 rns_units = (PIC32CK_RAM_SIZE / 2u) / PIC32CK_RAM_GRANULARITY;
        pic32ck_write_le32(cfm_buf, PIC32CK_FUSE_FUCFG15_OFF,
                           rns_units & PIC32CK_FUSE_IDAU_RNS_MASK);
    }
}

static void pic32ck_idau_reload_from_fuses(void)
{
    mm_u32 fucfg14;
    mm_u32 fucfg15;
    mm_u32 ans_size;
    mm_u32 ansc_size;
    mm_u32 rns_size;

    pic32ck_apply_default_fuses();
    fucfg14 = pic32ck_read_le32(cfm_buf, PIC32CK_FUSE_FUCFG14_OFF);
    fucfg15 = pic32ck_read_le32(cfm_buf, PIC32CK_FUSE_FUCFG15_OFF);

    ans_size = (fucfg14 & PIC32CK_FUSE_IDAU_ANS_MASK) * PIC32CK_FLASH_GRANULARITY;
    ansc_size = ((fucfg14 & PIC32CK_FUSE_IDAU_ANSC_MASK) != 0u)
        ? PIC32CK_ANSC_GRANULARITY : 0u;
    if (ans_size == 0u || ans_size > PIC32CK_FLASH_SIZE) {
        ans_size = PIC32CK_FLASH_SIZE / 2u;
    }
    if (ansc_size > ans_size) {
        ansc_size = ans_size;
    }
    rns_size = (fucfg15 & PIC32CK_FUSE_IDAU_RNS_MASK) * PIC32CK_RAM_GRANULARITY;
    if (rns_size == 0u || rns_size > PIC32CK_RAM_SIZE) {
        rns_size = PIC32CK_RAM_SIZE / 2u;
    }

    g_idau.enabled = MM_TRUE;
    g_idau.ans_size = ans_size;
    g_idau.ansc_size = ansc_size;
    g_idau.rns_size = rns_size;
}

static void pic32ck_idau_store_fuses(void)
{
    mm_u32 fucfg14 = 0u;
    mm_u32 fucfg15 = 0u;

    fucfg14 |= (g_idau.ans_size / PIC32CK_FLASH_GRANULARITY) & PIC32CK_FUSE_IDAU_ANS_MASK;
    if (g_idau.ansc_size != 0u) {
        fucfg14 |= PIC32CK_FUSE_IDAU_ANSC_MASK;
    }
    fucfg15 |= (g_idau.rns_size / PIC32CK_RAM_GRANULARITY) & PIC32CK_FUSE_IDAU_RNS_MASK;
    pic32ck_write_le32(cfm_buf, PIC32CK_FUSE_FUCFG14_OFF, fucfg14);
    pic32ck_write_le32(cfm_buf, PIC32CK_FUSE_FUCFG15_OFF, fucfg15);
}

static mm_bool pic32ck_main_flash_bounds(mm_u32 *secure_len_out,
                                         mm_u32 *nsc_len_out,
                                         mm_u32 *ns_len_out)
{
    mm_u32 secure_len;
    if (g_idau.ans_size > PIC32CK_FLASH_SIZE ||
        g_idau.ansc_size > g_idau.ans_size) {
        return MM_FALSE;
    }
    secure_len = PIC32CK_FLASH_SIZE - g_idau.ans_size;
    if (g_idau.ansc_size > secure_len + g_idau.ans_size) {
        return MM_FALSE;
    }
    secure_len -= g_idau.ansc_size;
    if (secure_len_out != 0) *secure_len_out = secure_len;
    if (nsc_len_out != 0) *nsc_len_out = g_idau.ansc_size;
    if (ns_len_out != 0) *ns_len_out = g_idau.ans_size;
    return MM_TRUE;
}

mm_bool mm_pic32ck_tz_attr_for_addr(mm_u32 addr,
                                    enum mm_sau_attr *attr_out,
                                    mm_u32 *region_out)
{
    mm_u32 secure_len;
    mm_u32 nsc_len;
    mm_u32 ns_len;

    if (attr_out == 0 || region_out == 0 || !g_idau.enabled) {
        return MM_FALSE;
    }
    if (addr >= PIC32CK_FLASH_BASE_S && (addr - PIC32CK_FLASH_BASE_S) < PIC32CK_FLASH_SIZE &&
        pic32ck_main_flash_bounds(&secure_len, &nsc_len, &ns_len)) {
        mm_u32 off = addr - PIC32CK_FLASH_BASE_S;
        if (off < secure_len) {
            *attr_out = MM_SAU_SECURE;
            *region_out = 0x08u;
        } else if (off < secure_len + nsc_len) {
            *attr_out = MM_SAU_NSC;
            *region_out = PIC32CK_IDAU_REGION_ANSC;
        } else {
            *attr_out = MM_SAU_NONSECURE;
            *region_out = PIC32CK_IDAU_REGION_ANS;
        }
        return MM_TRUE;
    }
    if (addr >= PIC32CK_CFM_BASE && (addr - PIC32CK_CFM_BASE) < PIC32CK_CFM_SIZE) {
        *attr_out = MM_SAU_SECURE;
        *region_out = PIC32CK_IDAU_REGION_CFMS;
        return MM_TRUE;
    }
    if (addr >= PIC32CK_RAM_BASE_S && (addr - PIC32CK_RAM_BASE_S) < PIC32CK_RAM_SIZE) {
        mm_u32 secure_ram = PIC32CK_RAM_SIZE - g_idau.rns_size;
        mm_u32 off = addr - PIC32CK_RAM_BASE_S;
        if (off < secure_ram) {
            *attr_out = MM_SAU_SECURE;
            *region_out = PIC32CK_IDAU_REGION_RS;
        } else {
            *attr_out = MM_SAU_NONSECURE;
            *region_out = PIC32CK_IDAU_REGION_RNS;
        }
        return MM_TRUE;
    }
    return MM_FALSE;
}

static mm_bool pic32ck_target_ptr(mm_u32 addr, mm_u32 size, mm_u8 **buf_out, mm_u32 *off_out)
{
    if (buf_out == 0 || off_out == 0) {
        return MM_FALSE;
    }
    if (addr >= PIC32CK_FLASH_BASE_S && (addr - PIC32CK_FLASH_BASE_S) + size <= g_flash_size) {
        *buf_out = g_flash_ptr;
        *off_out = addr - PIC32CK_FLASH_BASE_S;
        return MM_TRUE;
    }
    if (addr >= PIC32CK_CFM_BASE && (addr - PIC32CK_CFM_BASE) + size <= PIC32CK_CFM_SIZE) {
        *buf_out = cfm_buf;
        *off_out = addr - PIC32CK_CFM_BASE;
        return MM_TRUE;
    }
    return MM_FALSE;
}

static void pic32ck_flush_target(mm_u32 addr, mm_u32 size)
{
    if (g_map != 0 && g_map->code_cache != 0) {
        mm_code_cache_note_write(g_map->code_cache, addr, size);
    }
    if (g_persist != 0 && addr >= PIC32CK_FLASH_BASE_S &&
        (addr - PIC32CK_FLASH_BASE_S) < g_flash_size) {
        mm_u32 off = addr - PIC32CK_FLASH_BASE_S;
        mm_u32 span = size;
        if (off + span > g_flash_size) {
            span = g_flash_size - off;
        }
        mm_flash_persist_flush((struct mm_flash_persist *)g_persist, off, span);
    }
}

/* FCR -- Flash Controller Read (0x44002000, size 0x20) */
/* STATUS at offset 0x08 always 0x1 (READY) */
#define FCR_BASE    0x44002000u
#define FCR_SIZE    0x20u
#define FCR_STATUS  0x08u
static mm_u32 fcr_regs[FCR_SIZE / 4u];

static mm_bool fcr_read(void *opaque, mm_u32 offset, mm_u32 size_bytes,
                        mm_u32 *value_out)
{
    (void)opaque;
    if (value_out == 0 || size_bytes == 0 || size_bytes > 4u) return MM_FALSE;
    if ((offset + size_bytes) > FCR_SIZE) return MM_FALSE;
    if (offset == FCR_STATUS && size_bytes == 4u) {
        *value_out = 0x1u;
        return MM_TRUE;
    }
    memcpy(value_out, (mm_u8 *)fcr_regs + offset, size_bytes);
    return MM_TRUE;
}

static mm_bool fcr_write(void *opaque, mm_u32 offset, mm_u32 size_bytes,
                         mm_u32 value)
{
    (void)opaque;
    if (size_bytes == 0 || size_bytes > 4u) return MM_FALSE;
    if ((offset + size_bytes) > FCR_SIZE) return MM_FALSE;
    memcpy((mm_u8 *)fcr_regs + offset, &value, size_bytes);
    return MM_TRUE;
}

