imbluedabr/m33mu/cpu/pic32ck/pic32ck_mmio.c
/* FCW -- Flash Write Controller (0x44004000, size 0x200) */
/* INTFLAG at 0x14: DONE=bit0, write-1-to-clear; MUTEX at 0x08 */
#define FCW_BASE    0x44004000u
#define FCW_SIZE    0x200u
#define FCW_CTRLA   0x00u
#define FCW_CTRLB   0x04u
#define FCW_MUTEX   0x08u
#define FCW_STATUS  0x18u
#define FCW_INTFLAG 0x14u
#define FCW_INTENCLR 0x0Cu
#define FCW_INTENSET 0x10u
#define FCW_KEY     0x1Cu
#define FCW_ADDR    0x20u
#define FCW_SRCADDR 0x24u
#define FCW_DATA0   0x28u
#define FCW_SWAP    0x48u

#define FCW_STATUS_HTDRDY (1u << 8)
#define FCW_INTFLAG_DONE  (1u << 0)
#define FCW_INTFLAG_KEYERR (1u << 1)
#define FCW_INTFLAG_CFGERR (1u << 2)
#define FCW_INTFLAG_BUSERR (1u << 4)
#define FCW_INTFLAG_WPERR (1u << 5)
#define FCW_INTFLAG_OPERR (1u << 6)
#define FCW_INTFLAG_SECERR (1u << 7)
#define FCW_INTFLAG_WRERR  (1u << 13)
#define FCW_UNLOCK_WRKEY   0x91C32C01u

enum pic32ck_fcw_op {
    PIC32CK_FCW_OP_NOOP = 0u,
    PIC32CK_FCW_OP_SINGLE_DWORD = 1u,
    PIC32CK_FCW_OP_QUAD_DWORD = 2u,
    PIC32CK_FCW_OP_ROW_PROGRAM = 3u,
    PIC32CK_FCW_OP_PAGE_ERASE = 4u,
    PIC32CK_FCW_OP_PROGRAM_ERASE = 7u
};

static mm_u32 fcw_regs[FCW_SIZE / 4u];

static void fcw_flag_set(mm_u32 flag)
{
    fcw_regs[FCW_INTFLAG / 4u] |= flag;
}

static void fcw_set_error(mm_u32 flag)
{
    fcw_flag_set(flag);
}

static mm_bool pic32ck_copy_from_ram(mm_u32 addr, mm_u8 *dst, mm_u32 len)
{
    mm_u32 i;
    struct mm_memmap *map = mm_memmap_current();
    if (map == 0 || dst == 0) {
        return MM_FALSE;
    }
    for (i = 0; i < len; ++i) {
        if (!mm_memmap_read8(map, mmio_active_sec(), addr + i, &dst[i])) {
            return MM_FALSE;
        }
    }
    return MM_TRUE;
}

static mm_bool pic32ck_flash_program(mm_u32 addr, const mm_u8 *src, mm_u32 len)
{
    mm_u8 *buf;
    mm_u32 off;
    mm_u32 i;
    enum mm_sau_attr attr;
    mm_u32 region = 0u;

    if (src == 0 || !pic32ck_target_ptr(addr, len, &buf, &off)) {
        fcw_set_error(FCW_INTFLAG_WRERR);
        return MM_FALSE;
    }
    if (mmio_active_sec() == MM_NONSECURE &&
        mm_pic32ck_tz_attr_for_addr(addr, &attr, &region) &&
        attr != MM_SAU_NONSECURE) {
        fcw_set_error(FCW_INTFLAG_SECERR);
        return MM_FALSE;
    }
    for (i = 0; i < len; ++i) {
        buf[off + i] &= src[i];
    }
    if (buf == cfm_buf &&
        off <= PIC32CK_FUSE_FUCFG15_OFF + 3u &&
        (off + len) >= PIC32CK_FUSE_FUCFG14_OFF) {
        pic32ck_idau_reload_from_fuses();
    }
    pic32ck_flush_target(addr, len);
    return MM_TRUE;
}

static mm_bool pic32ck_flash_erase_page(mm_u32 addr)
{
    mm_u8 *buf;
    mm_u32 off;
    mm_u32 base = addr & ~(PIC32CK_FLASH_PAGE_SIZE - 1u);
    enum mm_sau_attr attr;
    mm_u32 region = 0u;

    if (!pic32ck_target_ptr(base, PIC32CK_FLASH_PAGE_SIZE, &buf, &off)) {
        fcw_set_error(FCW_INTFLAG_WRERR);
        return MM_FALSE;
    }
    if (mmio_active_sec() == MM_NONSECURE &&
        mm_pic32ck_tz_attr_for_addr(base, &attr, &region) &&
        attr != MM_SAU_NONSECURE) {
        fcw_set_error(FCW_INTFLAG_SECERR);
        return MM_FALSE;
    }
    memset(buf + off, 0xFF, PIC32CK_FLASH_PAGE_SIZE);
    if (buf == cfm_buf &&
        off <= PIC32CK_FUSE_FUCFG15_OFF + 3u &&
        (off + PIC32CK_FLASH_PAGE_SIZE) >= PIC32CK_FUSE_FUCFG14_OFF) {
        pic32ck_apply_default_fuses();
        pic32ck_idau_reload_from_fuses();
    }
    pic32ck_flush_target(base, PIC32CK_FLASH_PAGE_SIZE);
    return MM_TRUE;
}

static void fcw_execute(mm_u32 ctrla)
{
    mm_u32 op = ctrla & 0xFu;
    mm_u32 addr = fcw_regs[FCW_ADDR / 4u] & ~0x3u;
    mm_u8 tmp[PIC32CK_FLASH_ROW_SIZE];
    mm_bool ok = MM_FALSE;

    fcw_regs[FCW_STATUS / 4u] = FCW_STATUS_HTDRDY;
    if (!fcw_key_valid) {
        fcw_set_error(FCW_INTFLAG_KEYERR);
        return;
    }
    switch (op) {
    case PIC32CK_FCW_OP_NOOP:
        ok = MM_TRUE;
        break;
    case PIC32CK_FCW_OP_SINGLE_DWORD:
        memcpy(tmp, (mm_u8 *)fcw_regs + FCW_DATA0, PIC32CK_FLASH_SDW_SIZE);
        ok = pic32ck_flash_program(addr, tmp, PIC32CK_FLASH_SDW_SIZE);
        break;
    case PIC32CK_FCW_OP_QUAD_DWORD:
        memcpy(tmp, (mm_u8 *)fcw_regs + FCW_DATA0, PIC32CK_FLASH_QDW_SIZE);
        ok = pic32ck_flash_program(addr, tmp, PIC32CK_FLASH_QDW_SIZE);
        break;
    case PIC32CK_FCW_OP_ROW_PROGRAM:
        if (pic32ck_copy_from_ram(fcw_regs[FCW_SRCADDR / 4u] & ~0x3u, tmp,
                                  PIC32CK_FLASH_ROW_SIZE)) {
            ok = pic32ck_flash_program(addr, tmp, PIC32CK_FLASH_ROW_SIZE);
        } else {
            fcw_set_error(FCW_INTFLAG_BUSERR);
        }
        break;
    case PIC32CK_FCW_OP_PAGE_ERASE:
        ok = pic32ck_flash_erase_page(addr);
        break;
    case PIC32CK_FCW_OP_PROGRAM_ERASE:
        if (pic32ck_flash_erase_page(addr) &&
            pic32ck_copy_from_ram(fcw_regs[FCW_SRCADDR / 4u] & ~0x3u, tmp,
                                  PIC32CK_FLASH_ROW_SIZE)) {
            ok = pic32ck_flash_program(addr, tmp, PIC32CK_FLASH_ROW_SIZE);
        } else if ((fcw_regs[FCW_INTFLAG / 4u] & (FCW_INTFLAG_SECERR | FCW_INTFLAG_KEYERR)) == 0u) {
            fcw_set_error(FCW_INTFLAG_BUSERR);
        }
        break;
    default:
        fcw_set_error(FCW_INTFLAG_OPERR);
        break;
    }
    if (ok) {
        fcw_flag_set(FCW_INTFLAG_DONE);
    }
}

static mm_bool fcw_read(void *opaque, mm_u32 offset, mm_u32 size_bytes,
                        mm_u32 *value_out)
{
    (void)opaque;
    if (value_out == 0 || size_bytes == 0 || size_bytes > 4u) return MM_FALSE;
    if ((offset + size_bytes) > FCW_SIZE) return MM_FALSE;
    memcpy(value_out, (mm_u8 *)fcw_regs + offset, size_bytes);
    return MM_TRUE;
}

static mm_bool fcw_write(void *opaque, mm_u32 offset, mm_u32 size_bytes,
                         mm_u32 value)
{
    (void)opaque;
    if (size_bytes == 0 || size_bytes > 4u) return MM_FALSE;
    if ((offset + size_bytes) > FCW_SIZE) return MM_FALSE;
    if (offset == FCW_INTFLAG) {
        fcw_regs[FCW_INTFLAG / 4u] &= ~value;
        return MM_TRUE;
    }
    if (offset == FCW_INTENCLR) {
        fcw_regs[FCW_INTENSET / 4u] &= ~value;
        return MM_TRUE;
    }
    if (offset == FCW_INTENSET) {
        fcw_regs[FCW_INTENSET / 4u] |= value;
        return MM_TRUE;
    }
    memcpy((mm_u8 *)fcw_regs + offset, &value, size_bytes);
    if (offset == FCW_KEY && size_bytes == 4u) {
        fcw_key_valid = (value == FCW_UNLOCK_WRKEY) ? MM_TRUE : MM_FALSE;
        if (!fcw_key_valid) {
            fcw_set_error(FCW_INTFLAG_KEYERR);
        }
        return MM_TRUE;
    }
    if (offset == FCW_CTRLA && size_bytes == 4u) {
        fcw_execute(value);
        fcw_key_valid = MM_FALSE;
        return MM_TRUE;
    }
    return MM_TRUE;
}

/* GCLK (0x44010000, size 0x200)
 * SYNCBUSY at 0x04: always 0 (no sync delays in emulator)
 * GENCTRL[n] at 0x20+n*4: accept r/w
 * PCHCTRL[n] at 0x80+n*4: read back with CHEN (bit6) always set so
 *   firmware does not spin waiting for clock enable confirmation.
 */
#define GCLK_BASE     0x44010000u
#define GCLK_SIZE     0x200u
#define GCLK_SYNCBUSY 0x04u
#define GCLK_PCHCTRL0 0x80u
static mm_u32 gclk_regs[GCLK_SIZE / 4u];

static mm_bool gclk_read(void *opaque, mm_u32 offset, mm_u32 size_bytes,
                         mm_u32 *value_out)
{
    (void)opaque;
    if (value_out == 0 || size_bytes == 0 || size_bytes > 4u) return MM_FALSE;
    if ((offset + size_bytes) > GCLK_SIZE) return MM_FALSE;
    /* SYNCBUSY always 0 */
    if ((offset & ~3u) == (GCLK_SYNCBUSY & ~3u)) {
        mm_u32 v = 0u;
        memcpy(value_out, (mm_u8 *)&v + (offset & 3u), size_bytes);
        return MM_TRUE;
    }
    /* PCHCTRL[n]: return stored value with CHEN (bit6) always set */
    if (offset >= GCLK_PCHCTRL0 && offset < GCLK_SIZE) {
        mm_u32 v;
        memcpy(&v, (mm_u8 *)gclk_regs + (offset & ~3u), 4u);
        v |= (1u << 6);  /* CHEN always set */
        memcpy(value_out, (mm_u8 *)&v + (offset & 3u), size_bytes);
        return MM_TRUE;
    }
    memcpy(value_out, (mm_u8 *)gclk_regs + offset, size_bytes);
    return MM_TRUE;
}

static mm_bool gclk_write(void *opaque, mm_u32 offset, mm_u32 size_bytes,
                          mm_u32 value)
{
    (void)opaque;
    if (size_bytes == 0 || size_bytes > 4u) return MM_FALSE;
    if ((offset + size_bytes) > GCLK_SIZE) return MM_FALSE;
    memcpy((mm_u8 *)gclk_regs + offset, &value, size_bytes);
    return MM_TRUE;
}

/* PORT (0x44800000, size 0x200 -- 4 port groups A-D, stride 0x80)
 * Each group has set/clear/toggle aliases for DIR and OUT.
 * Layout per group (offset within group):
 *   0x00 DIR    0x04 DIRCLR  0x08 DIRSET  0x0C DIRTGL
 *   0x10 OUT    0x14 OUTCLR  0x18 OUTSET  0x1C OUTTGL
 *   0x20 IN     0x24 CTRL    0x28 WRCONFIG
 *   0x30 EVCTRL
 *   0x40 PINCFG[0..31]  (1 byte each)
 *   0x60 PMUX[0..15]    (1 byte each, 2 pins per byte)
 */
#define PORT_BASE       0x44800000u
#define PORT_SIZE       0x200u
#define PORT_GROUP_SIZE 0x80u
#define PORT_NGROUPS    4u

/* Group register offsets (byte offsets within a group) */
#define PG_DIR    0x00u
#define PG_DIRCLR 0x04u
#define PG_DIRSET 0x08u
#define PG_DIRTGL 0x0Cu
#define PG_OUT    0x10u
#define PG_OUTCLR 0x14u
#define PG_OUTSET 0x18u
#define PG_OUTTGL 0x1Cu
#define PG_IN     0x20u

