imbluedabr/m33mu/cpu/pic32ck/pic32ck_mmio.c
/* Per-group state */
struct port_group_state {
    mm_u32 dir;
    mm_u32 out;
    mm_u32 in;
    mm_u8  pincfg[32];
    mm_u8  pmux[16];
    mm_u32 evctrl;
    mm_u32 ctrl;
    mm_u32 wrconfig;
};
static struct port_group_state port_groups[PORT_NGROUPS];

static mm_bool port_read(void *opaque, mm_u32 offset, mm_u32 size_bytes,
                         mm_u32 *value_out)
{
    mm_u32 grp_idx, grp_off, val;
    struct port_group_state *g;
    (void)opaque;
    if (value_out == 0 || size_bytes == 0 || size_bytes > 4u) return MM_FALSE;
    if ((offset + size_bytes) > PORT_SIZE) return MM_FALSE;
    grp_idx = offset / PORT_GROUP_SIZE;
    grp_off = offset % PORT_GROUP_SIZE;
    if (grp_idx >= PORT_NGROUPS) { *value_out = 0; return MM_TRUE; }
    g = &port_groups[grp_idx];
    switch (grp_off & ~3u) {
    case PG_DIR:    val = g->dir; break;
    case PG_DIRCLR: val = g->dir; break;
    case PG_DIRSET: val = g->dir; break;
    case PG_DIRTGL: val = g->dir; break;
    case PG_OUT:    val = g->out; break;
    case PG_OUTCLR: val = g->out; break;
    case PG_OUTSET: val = g->out; break;
    case PG_OUTTGL: val = g->out; break;
    case PG_IN:     val = g->in;  break;
    default:        val = 0;      break;
    }
    /* Handle sub-word reads */
    memcpy(value_out, (mm_u8 *)&val + (grp_off & 3u), size_bytes);
    return MM_TRUE;
}

static mm_bool port_write(void *opaque, mm_u32 offset, mm_u32 size_bytes,
                          mm_u32 value)
{
    mm_u32 grp_idx, grp_off;
    struct port_group_state *g;
    (void)opaque;
    if (size_bytes == 0 || size_bytes > 4u) return MM_FALSE;
    if ((offset + size_bytes) > PORT_SIZE) return MM_FALSE;
    grp_idx = offset / PORT_GROUP_SIZE;
    grp_off = offset % PORT_GROUP_SIZE;
    if (grp_idx >= PORT_NGROUPS) return MM_TRUE;
    g = &port_groups[grp_idx];
    /* Expand sub-word writes to 32-bit for set/clr registers */
    if (size_bytes < 4u) {
        mm_u32 tmp = 0u;
        memcpy(&tmp, &value, size_bytes);
        value = tmp;
    }
    switch (grp_off) {
    case PG_DIR:    g->dir  = value;          break;
    case PG_DIRCLR: g->dir &= ~value;         break;
    case PG_DIRSET: g->dir |=  value;         break;
    case PG_DIRTGL: g->dir ^=  value;         break;
    case PG_OUT:    g->out  = value;           break;
    case PG_OUTCLR: g->out &= ~value;          break;
    case PG_OUTSET: g->out |=  value;          break;
    case PG_OUTTGL: g->out ^=  value;          break;
    case PG_IN:     g->in   = value;           break;
    default:        break;
    }
    return MM_TRUE;
}

/* Generic peripheral stubs */
/* TRNG (0x45024000, size 0x24)
 * CTRLA   [0x00]: ENABLE=bit1
 * INTFLAG [0x0A]: DATARDY=bit0 -- always set (data always ready)
 * DATA    [0x20]: random data -- return pseudo-random value
 */
#define TRNG_BASE    0x45024000u
#define TRNG_SIZE    0x24u
#define TRNG_INTFLAG 0x0Au
#define TRNG_DATA    0x20u
static mm_u32 trng_regs[TRNG_SIZE / 4u];
static mm_u32 trng_counter;

static mm_bool trng_read(void *opaque, mm_u32 offset, mm_u32 size_bytes,
                         mm_u32 *value_out)
{
    (void)opaque;
    if (value_out == 0 || size_bytes == 0 || size_bytes > 4u) return MM_FALSE;
    if ((offset + size_bytes) > TRNG_SIZE) return MM_FALSE;
    if (offset == TRNG_INTFLAG && size_bytes == 1u) {
        *value_out = 0x1u;  /* DATARDY always set */
        return MM_TRUE;
    }
    if (offset == TRNG_DATA && size_bytes == 4u) {
        /* Simple LCG for deterministic pseudo-random output */
        trng_counter = trng_counter * 1664525u + 1013904223u;
        *value_out = trng_counter ^ 0xA5A5A5A5u;
        return MM_TRUE;
    }
    memcpy(value_out, (mm_u8 *)trng_regs + offset, size_bytes);
    return MM_TRUE;
}

static mm_bool trng_write(void *opaque, mm_u32 offset, mm_u32 size_bytes,
                          mm_u32 value)
{
    (void)opaque;
    if (size_bytes == 0 || size_bytes > 4u) return MM_FALSE;
    if ((offset + size_bytes) > TRNG_SIZE) return MM_FALSE;
    memcpy((mm_u8 *)trng_regs + offset, &value, size_bytes);
    return MM_TRUE;
}

#define CFM_SIZE PIC32CK_CFM_SIZE
static mm_bool cfm_read(void *opaque, mm_u32 offset, mm_u32 size_bytes,
                        mm_u32 *value_out)
{
    (void)opaque;
    if (value_out == 0 || size_bytes == 0 || size_bytes > 4u) return MM_FALSE;
    if ((offset + size_bytes) > CFM_SIZE) return MM_FALSE;
    memcpy(value_out, cfm_buf + offset, size_bytes);
    return MM_TRUE;
}

static mm_bool cfm_write(void *opaque, mm_u32 offset, mm_u32 size_bytes,
                         mm_u32 value)
{
    (void)opaque;
    (void)offset;
    (void)size_bytes;
    (void)value;
    return MM_FALSE;
}

#define IDAU_BASE    0x4480C000u
#define IDAU_SIZE    0x1180u
#define IDAU_CTRL    0x000u
#define IDAU_STATUSA 0x004u
#define IDAU_STATUSB 0x008u
#define IDAU_REGIONS 0x1000u
#define IDAU_REGION_STRIDE 0x10u

#define IDAU_CTRL_ENABLE_CMD  0xA501u
#define IDAU_CTRL_DISABLE_CMD 0xA502u
#define IDAU_CTRL_WLCK_CMD    0xA503u
#define IDAU_RCTRL_WRSZ_CMD   0x5Cu

static mm_u32 pic32ck_idau_region_size(mm_u32 region)
{
    switch (region) {
    case 0x08u: return PIC32CK_FLASH_SIZE - g_idau.ans_size - g_idau.ansc_size;
    case PIC32CK_IDAU_REGION_ANSC: return g_idau.ansc_size;
    case PIC32CK_IDAU_REGION_ANS: return g_idau.ans_size;
    case PIC32CK_IDAU_REGION_RS: return PIC32CK_RAM_SIZE - g_idau.rns_size;
    case PIC32CK_IDAU_REGION_RNS: return g_idau.rns_size;
    case PIC32CK_IDAU_REGION_CFMS: return PIC32CK_CFM_SIZE;
    default: return 0u;
    }
}

static mm_u32 pic32ck_idau_region_statusa(mm_u32 region)
{
    mm_u32 type = 0u;
    mm_u32 gran = 0u;
    mm_u32 maxsz = 0u;
    switch (region) {
    case 0x08u:
        type = 0x1u;
        gran = 0x0Cu;
        maxsz = 0x15u;
        break;
    case PIC32CK_IDAU_REGION_ANSC:
        type = 0x6u;
        gran = 0x0Cu;
        maxsz = 0x15u;
        break;
    case PIC32CK_IDAU_REGION_ANS:
        type = 0x3u;
        gran = 0x0Cu;
        maxsz = 0x15u;
        break;
    case PIC32CK_IDAU_REGION_RS:
        type = 0x1u;
        gran = 0x0Cu;
        maxsz = 0x13u;
        break;
    case PIC32CK_IDAU_REGION_RNS:
        type = 0x3u;
        gran = 0x0Cu;
        maxsz = 0x13u;
        break;
    case PIC32CK_IDAU_REGION_CFMS:
        type = 0x1u;
        gran = 0x0Cu;
        maxsz = 0x10u;
        break;
    default:
        break;
    }
    return type | (gran << 8) | (maxsz << 16);
}

static mm_bool idau_read(void *opaque, mm_u32 offset, mm_u32 size_bytes,
                         mm_u32 *value_out)
{
    mm_u32 reg_off;
    mm_u32 region;
    mm_u32 v = 0u;
    (void)opaque;
    if (value_out == 0 || size_bytes == 0 || size_bytes > 4u) return MM_FALSE;
    if ((offset + size_bytes) > IDAU_SIZE) return MM_FALSE;
    if (offset == IDAU_STATUSA) {
        v = (g_idau.enabled ? 1u : 0u) |
            ((g_idau.write_locked ? 1u : 0u) << 1) |
            (24u << 8);
        memcpy(value_out, &v, size_bytes);
        return MM_TRUE;
    }
    if (offset == IDAU_STATUSB) {
        v = g_idau.statusb;
        memcpy(value_out, &v, size_bytes);
        return MM_TRUE;
    }
    if (offset < IDAU_REGIONS) {
        return MM_TRUE;
    }
    region = (offset - IDAU_REGIONS) / IDAU_REGION_STRIDE;
    reg_off = (offset - IDAU_REGIONS) % IDAU_REGION_STRIDE;
    if (region >= 24u) return MM_FALSE;
    switch (reg_off & ~3u) {
    case 0x04u: v = pic32ck_idau_region_statusa(region); break;
    case 0x08u: v = pic32ck_idau_region_size(region); break;
    case 0x0Cu: v = 0u; break;
    default:    v = 0u; break;
    }
    memcpy(value_out, (mm_u8 *)&v + (reg_off & 3u), size_bytes);
    return MM_TRUE;
}

