imbluedabr/m33mu/cpu/pic32ck/pic32ck_mmio.c
static mm_bool idau_write(void *opaque, mm_u32 offset, mm_u32 size_bytes,
                          mm_u32 value)
{
    mm_u32 region;
    mm_u32 arg;
    mm_u32 cmd;
    (void)opaque;
    if (size_bytes != 4u) return MM_FALSE;
    if ((offset + size_bytes) > IDAU_SIZE) return MM_FALSE;
    if (offset == IDAU_CTRL) {
        cmd = (value >> 16) & 0xFFFFu;
        if (cmd == IDAU_CTRL_ENABLE_CMD) {
            g_idau.enabled = MM_TRUE;
        } else if (cmd == IDAU_CTRL_DISABLE_CMD) {
            g_idau.enabled = MM_FALSE;
        } else if (cmd == IDAU_CTRL_WLCK_CMD) {
            g_idau.write_locked = MM_TRUE;
        }
        return MM_TRUE;
    }
    if (offset == IDAU_STATUSB) {
        g_idau.statusb &= ~value;
        return MM_TRUE;
    }
    if (offset < IDAU_REGIONS || g_idau.write_locked || !g_idau.enabled) {
        return MM_TRUE;
    }
    region = (offset - IDAU_REGIONS) / IDAU_REGION_STRIDE;
    if (((offset - IDAU_REGIONS) % IDAU_REGION_STRIDE) != 0u) {
        return MM_TRUE;
    }
    cmd = (value >> 24) & 0xFFu;
    arg = value & 0x00FFFFFFu;
    if (cmd != IDAU_RCTRL_WRSZ_CMD) {
        g_idau.statusb |= 1u;
        return MM_TRUE;
    }
    switch (region) {
    case PIC32CK_IDAU_REGION_ANS:
        g_idau.ans_size = pic32ck_clamp_partition(arg, PIC32CK_FLASH_GRANULARITY,
                                                  PIC32CK_FLASH_SIZE);
        if (g_idau.ans_size == 0u) g_idau.ans_size = PIC32CK_FLASH_GRANULARITY;
        if (g_idau.ansc_size > g_idau.ans_size) g_idau.ansc_size = g_idau.ans_size;
        pic32ck_idau_store_fuses();
        break;
    case PIC32CK_IDAU_REGION_ANSC:
        g_idau.ansc_size = pic32ck_clamp_partition(arg, PIC32CK_ANSC_GRANULARITY,
                                                   g_idau.ans_size);
        pic32ck_idau_store_fuses();
        break;
    case PIC32CK_IDAU_REGION_RNS:
        g_idau.rns_size = pic32ck_clamp_partition(arg, PIC32CK_RAM_GRANULARITY,
                                                  PIC32CK_RAM_SIZE);
        if (g_idau.rns_size == 0u) g_idau.rns_size = PIC32CK_RAM_GRANULARITY;
        pic32ck_idau_store_fuses();
        break;
    default:
        g_idau.statusb |= 1u;
        break;
    }
    return MM_TRUE;
}

DECL_STUB(osc32kctrl, 0x20u);   /* 0x4400E000 */
DECL_STUB(pm,         0x20u);   /* 0x44010000 */
DECL_STUB(wdt,        0x10u);   /* 0x44016000 */
DECL_STUB(rtc,        0x80u);   /* 0x44013000 */
DECL_STUB(eic,        0x40u);   /* 0x44015000 */
DECL_STUB(eic_sec,    0x40u);   /* 0x44015200 */
DECL_STUB(pac,        0x80u);   /* 0x44000000 */
DECL_STUB(dma0,       0x100u);  /* 0x44110000 */
DECL_STUB(dma1,       0x100u);  /* 0x44120000 */
DECL_STUB(freqm,      0x20u);   /* 0x44017000 */

void mm_pic32ck_mmio_reset(void)
{
    memset(mclk_regs,       0, sizeof(mclk_regs));
    memset(oscctrl_regs,    0, sizeof(oscctrl_regs));
    memset(supc_regs,       0, sizeof(supc_regs));
    memset(fcr_regs,        0, sizeof(fcr_regs));
    memset(fcw_regs,        0, sizeof(fcw_regs));
    fcw_regs[FCW_CTRLB / 4u] = 0xFFu;
    fcw_regs[FCW_STATUS / 4u] = FCW_STATUS_HTDRDY;
    memset(gclk_regs,       0, sizeof(gclk_regs));
    memset(trng_regs,       0, sizeof(trng_regs));
    trng_counter = 0x12345678u;
    memset(port_groups,     0, sizeof(port_groups));
    memset(osc32kctrl_regs, 0, sizeof(osc32kctrl_regs));
    memset(pm_regs,         0, sizeof(pm_regs));
    memset(wdt_regs,        0, sizeof(wdt_regs));
    memset(rtc_regs,        0, sizeof(rtc_regs));
    memset(eic_regs,        0, sizeof(eic_regs));
    memset(eic_sec_regs,    0, sizeof(eic_sec_regs));
    memset(pac_regs,        0, sizeof(pac_regs));
    memset(dma0_regs,       0, sizeof(dma0_regs));
    memset(dma1_regs,       0, sizeof(dma1_regs));
    memset(freqm_regs,      0, sizeof(freqm_regs));
    memset(&g_idau,         0, sizeof(g_idau));
    pic32ck_idau_reload_from_fuses();
    g_flash_ptr  = 0;
    g_flash_size = 0u;
    g_map = 0;
    g_persist = 0;
    fcw_key_valid = MM_FALSE;
}

mm_bool mm_pic32ck_register_mmio(struct mmio_bus *bus)
{
    struct mmio_region reg;

    /* MCLK */
    reg.base   = MCLK_BASE;
    reg.size   = MCLK_SIZE;
    reg.opaque = 0;
    reg.read   = mclk_read;
    reg.write  = mclk_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    /* OSCCTRL */
    reg.base   = OSCCTRL_BASE;
    reg.size   = OSCCTRL_SIZE;
    reg.opaque = 0;
    reg.read   = oscctrl_read;
    reg.write  = oscctrl_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    /* SUPC */
    reg.base   = SUPC_BASE;
    reg.size   = SUPC_SIZE;
    reg.opaque = 0;
    reg.read   = supc_read;
    reg.write  = supc_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    /* FCR */
    reg.base   = FCR_BASE;
    reg.size   = FCR_SIZE;
    reg.opaque = 0;
    reg.read   = fcr_read;
    reg.write  = fcr_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    /* FCW */
    reg.base   = FCW_BASE;
    reg.size   = FCW_SIZE;
    reg.opaque = 0;
    reg.read   = fcw_read;
    reg.write  = fcw_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    /* CFM */
    reg.base   = PIC32CK_CFM_BASE;
    reg.size   = PIC32CK_CFM_SIZE;
    reg.opaque = 0;
    reg.read   = cfm_read;
    reg.write  = cfm_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    /* TRNG */
    reg.base   = TRNG_BASE;
    reg.size   = TRNG_SIZE;
    reg.opaque = 0;
    reg.read   = trng_read;
    reg.write  = trng_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    /* GCLK */
    reg.base   = GCLK_BASE;
    reg.size   = GCLK_SIZE;
    reg.opaque = 0;
    reg.read   = gclk_read;
    reg.write  = gclk_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    /* PORT (NS + Secure alias) */
    reg.base   = PORT_BASE;
    reg.size   = PORT_SIZE;
    reg.opaque = 0;
    reg.read   = port_read;
    reg.write  = port_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
    /* Secure alias at 0x44801000 -- share same handler */
    reg.base   = 0x44801000u;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    /* Generic stubs */
    if (!stub_reg_one(bus, &osc32kctrl_stub, 0x4400E000u)) return MM_FALSE;
    if (!stub_reg_one(bus, &pm_stub,          0x44006000u)) return MM_FALSE;
    if (!stub_reg_one(bus, &wdt_stub,         0x44016000u)) return MM_FALSE;
    if (!stub_reg_one(bus, &rtc_stub,         0x44018000u)) return MM_FALSE;
    if (!stub_reg_one(bus, &eic_stub,         0x4401A000u)) return MM_FALSE;
    if (!stub_reg_one(bus, &eic_sec_stub,     0x4401B000u)) return MM_FALSE;
    if (!stub_reg_one(bus, &pac_stub,         0x4401C000u)) return MM_FALSE;
    reg.base   = IDAU_BASE;
    reg.size   = IDAU_SIZE;
    reg.opaque = 0;
    reg.read   = idau_read;
    reg.write  = idau_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
    if (!stub_reg_one(bus, &dma0_stub,        0x44802000u)) return MM_FALSE;
    if (!stub_reg_one(bus, &dma1_stub,        0x44804000u)) return MM_FALSE;
    if (!stub_reg_one(bus, &freqm_stub,       0x44014000u)) return MM_FALSE;
    /* DSU not mapped — omit */

    return MM_TRUE;
}

void mm_pic32ck_flash_bind(struct mm_memmap *map,
                               mm_u8 *flash, mm_u32 flash_size,
                               const struct mm_flash_persist *persist,
                               mm_u32 flags)
{
    (void)flags;
    g_map = map;
    g_flash_ptr  = flash;
    g_flash_size = flash_size;
    g_persist = persist;
    if (!cfm_initialized) {
        memset(cfm_buf, 0xFF, sizeof(cfm_buf));
        cfm_initialized = MM_TRUE;
    }
    pic32ck_idau_reload_from_fuses();
}

mm_u64 mm_pic32ck_cpu_hz(void)
{
    return 96000000ULL;
}
